fioLogs_qemu_always/fio-4k-read.log
file1: (g=0): rw=randread, bs=(R) 4096B-4096B, (W) 4096B-4096B, (T) 4096B-4096B, ioengine=libaio, iodepth=16
...
fio-3.1
Starting 8 processes

file1: (groupid=0, jobs=1): err= 0: pid=21: Mon Feb 17 15:16:03 2020
   read: IOPS=296, BW=1184KiB/s (1213kB/s)(1041MiB/900002msec)
    slat (nsec): min=1906, max=318386k, avg=3374647.71, stdev=4926336.92
    clat (usec): min=2, max=532548, avg=50656.60, stdev=37256.79
     lat (usec): min=866, max=545631, avg=54031.82, stdev=39136.86
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   12], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   32], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   70], 90.00th=[  101], 95.00th=[  123],
     | 99.00th=[  190], 99.50th=[  211], 99.90th=[  262], 99.95th=[  296],
     | 99.99th=[  380]
   bw (  KiB/s): min=  169, max= 2522, per=12.50%, avg=1186.34, stdev=461.22, samples=1800
   iops        : min=   42, max=  630, avg=296.20, stdev=115.19, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.03%
  lat (msec)   : 2=0.91%, 4=0.16%, 10=3.34%, 20=9.35%, 50=50.51%
  lat (msec)   : 100=25.83%, 250=9.73%, 500=0.13%, 750=0.01%
  cpu          : usr=0.04%, sys=3.12%, ctx=957131, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=266471,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=22: Mon Feb 17 15:16:03 2020
   read: IOPS=295, BW=1181KiB/s (1210kB/s)(1038MiB/900005msec)
    slat (nsec): min=1887, max=328737k, avg=3383560.50, stdev=4945158.06
    clat (usec): min=2, max=560166, avg=50791.52, stdev=37416.20
     lat (usec): min=821, max=567645, avg=54175.65, stdev=39310.18
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   11], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   32], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   71], 90.00th=[  101], 95.00th=[  122],
     | 99.00th=[  192], 99.50th=[  213], 99.90th=[  264], 99.95th=[  305],
     | 99.99th=[  426]
   bw (  KiB/s): min=  128, max= 2720, per=12.51%, avg=1187.27, stdev=468.82, samples=1800
   iops        : min=   32, max=  680, avg=296.48, stdev=117.21, samples=1800
  lat (usec)   : 4=0.01%, 750=0.01%, 1000=0.03%
  lat (msec)   : 2=0.90%, 4=0.15%, 10=3.47%, 20=9.31%, 50=50.29%
  lat (msec)   : 100=25.93%, 250=9.78%, 500=0.13%, 750=0.01%
  cpu          : usr=0.04%, sys=3.08%, ctx=952958, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=265770,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=23: Mon Feb 17 15:16:03 2020
   read: IOPS=298, BW=1193KiB/s (1221kB/s)(1048MiB/900003msec)
    slat (nsec): min=1811, max=322619k, avg=3351137.62, stdev=4935427.86
    clat (usec): min=2, max=531598, avg=50305.80, stdev=37373.77
     lat (usec): min=870, max=545730, avg=53657.50, stdev=39284.25
    clat percentiles (msec):
     |  1.00th=[    4],  5.00th=[   11], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   31], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   70], 90.00th=[  101], 95.00th=[  122],
     | 99.00th=[  192], 99.50th=[  211], 99.90th=[  264], 99.95th=[  309],
     | 99.99th=[  384]
   bw (  KiB/s): min=  167, max= 2872, per=12.56%, avg=1191.46, stdev=469.63, samples=1800
   iops        : min=   41, max=  718, avg=297.77, stdev=117.51, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.03%
  lat (msec)   : 2=0.86%, 4=0.15%, 10=3.61%, 20=9.54%, 50=50.75%
  lat (msec)   : 100=25.19%, 250=9.74%, 500=0.14%, 750=0.01%
  cpu          : usr=0.04%, sys=3.11%, ctx=952252, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=268336,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=24: Mon Feb 17 15:16:03 2020
   read: IOPS=293, BW=1174KiB/s (1202kB/s)(1032MiB/900001msec)
    slat (nsec): min=1912, max=328994k, avg=3404982.00, stdev=4956377.39
    clat (usec): min=2, max=519681, avg=51114.32, stdev=37418.06
     lat (usec): min=868, max=534971, avg=54519.89, stdev=39303.25
    clat percentiles (usec):
     |  1.00th=[  1516],  5.00th=[ 10683], 10.00th=[ 16581], 20.00th=[ 24249],
     | 30.00th=[ 31589], 40.00th=[ 35390], 50.00th=[ 40633], 60.00th=[ 47973],
     | 70.00th=[ 55837], 80.00th=[ 70779], 90.00th=[101188], 95.00th=[123208],
     | 99.00th=[189793], 99.50th=[208667], 99.90th=[256902], 99.95th=[295699],
     | 99.99th=[383779]
   bw (  KiB/s): min=  143, max= 2650, per=12.41%, avg=1177.25, stdev=464.23, samples=1800
   iops        : min=   35, max=  662, avg=293.98, stdev=116.03, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.03%
  lat (msec)   : 2=0.99%, 4=0.16%, 10=3.45%, 20=8.91%, 50=50.35%
  lat (msec)   : 100=25.85%, 250=10.15%, 500=0.11%, 750=0.01%
  cpu          : usr=0.04%, sys=3.12%, ctx=951605, majf=0, minf=119019
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=264086,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=25: Mon Feb 17 15:16:03 2020
   read: IOPS=298, BW=1196KiB/s (1225kB/s)(1051MiB/900005msec)
    slat (nsec): min=1799, max=326873k, avg=3341635.08, stdev=4923766.39
    clat (usec): min=2, max=533976, avg=50163.85, stdev=37127.29
     lat (usec): min=960, max=542391, avg=53506.05, stdev=38999.55
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   11], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   31], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   69], 90.00th=[   99], 95.00th=[  122],
     | 99.00th=[  192], 99.50th=[  213], 99.90th=[  257], 99.95th=[  305],
     | 99.99th=[  401]
   bw (  KiB/s): min=  152, max= 2427, per=12.67%, avg=1202.54, stdev=472.76, samples=1800
   iops        : min=   38, max=  606, avg=300.28, stdev=118.20, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.02%
  lat (msec)   : 2=0.96%, 4=0.15%, 10=3.48%, 20=9.15%, 50=51.25%
  lat (msec)   : 100=25.46%, 250=9.42%, 500=0.12%, 750=0.01%
  cpu          : usr=0.03%, sys=3.11%, ctx=958150, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=269099,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=26: Mon Feb 17 15:16:03 2020
   read: IOPS=298, BW=1193KiB/s (1222kB/s)(1049MiB/900005msec)
    slat (nsec): min=1851, max=307198k, avg=3349270.99, stdev=4930949.20
    clat (usec): min=2, max=529690, avg=50277.32, stdev=37464.18
     lat (usec): min=854, max=556064, avg=53627.16, stdev=39368.63
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   11], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   31], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   69], 90.00th=[  100], 95.00th=[  122],
     | 99.00th=[  194], 99.50th=[  215], 99.90th=[  266], 99.95th=[  309],
     | 99.99th=[  426]
   bw (  KiB/s): min=  152, max= 2666, per=12.63%, avg=1198.34, stdev=468.12, samples=1800
   iops        : min=   38, max=  666, avg=299.26, stdev=117.01, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.02%
  lat (msec)   : 2=0.93%, 4=0.16%, 10=3.52%, 20=9.45%, 50=50.97%
  lat (msec)   : 100=25.24%, 250=9.56%, 500=0.14%, 750=0.01%
  cpu          : usr=0.03%, sys=3.13%, ctx=962026, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=268488,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=27: Mon Feb 17 15:16:03 2020
   read: IOPS=296, BW=1187KiB/s (1215kB/s)(1043MiB/900003msec)
    slat (nsec): min=1886, max=322676k, avg=3367609.75, stdev=4951917.26
    clat (usec): min=2, max=495875, avg=50553.26, stdev=37372.40
     lat (usec): min=886, max=512174, avg=53921.44, stdev=39264.39
    clat percentiles (msec):
     |  1.00th=[    5],  5.00th=[   12], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   31], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   70], 90.00th=[  101], 95.00th=[  123],
     | 99.00th=[  192], 99.50th=[  211], 99.90th=[  259], 99.95th=[  313],
     | 99.99th=[  397]
   bw (  KiB/s): min=  169, max= 2584, per=12.49%, avg=1185.50, stdev=468.64, samples=1800
   iops        : min=   42, max=  646, avg=296.29, stdev=117.26, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.02%
  lat (msec)   : 2=0.84%, 4=0.14%, 10=3.30%, 20=9.34%, 50=50.98%
  lat (msec)   : 100=25.39%, 250=9.86%, 500=0.12%
  cpu          : usr=0.03%, sys=3.06%, ctx=953069, majf=0, minf=119019
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=267027,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16
file1: (groupid=0, jobs=1): err= 0: pid=28: Mon Feb 17 15:16:03 2020
   read: IOPS=295, BW=1181KiB/s (1210kB/s)(1038MiB/900003msec)
    slat (nsec): min=1801, max=327369k, avg=3382974.10, stdev=4942336.76
    clat (usec): min=3, max=513911, avg=50782.73, stdev=37558.44
     lat (usec): min=934, max=529425, avg=54166.28, stdev=39461.83
    clat percentiles (msec):
     |  1.00th=[    3],  5.00th=[   11], 10.00th=[   17], 20.00th=[   24],
     | 30.00th=[   32], 40.00th=[   35], 50.00th=[   41], 60.00th=[   48],
     | 70.00th=[   56], 80.00th=[   71], 90.00th=[  101], 95.00th=[  122],
     | 99.00th=[  194], 99.50th=[  213], 99.90th=[  264], 99.95th=[  305],
     | 99.99th=[  435]
   bw (  KiB/s): min=  129, max= 2515, per=12.60%, avg=1195.50, stdev=469.58, samples=1800
   iops        : min=   32, max=  628, avg=298.49, stdev=117.40, samples=1800
  lat (usec)   : 4=0.01%, 1000=0.02%
  lat (msec)   : 2=0.90%, 4=0.16%, 10=3.49%, 20=9.31%, 50=50.30%
  lat (msec)   : 100=25.81%, 250=9.86%, 500=0.14%, 750=0.01%
  cpu          : usr=0.04%, sys=3.12%, ctx=954143, majf=0, minf=119018
  IO depths    : 1=0.1%, 2=0.1%, 4=0.1%, 8=0.1%, 16=100.0%, 32=0.0%, >=64=0.0%
     submit    : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.0%, 32=0.0%, 64=0.0%, >=64=0.0%
     complete  : 0=0.0%, 4=100.0%, 8=0.0%, 16=0.1%, 32=0.0%, 64=0.0%, >=64=0.0%
     issued rwt: total=265811,0,0, short=0,0,0, dropped=0,0,0
     latency   : target=0, window=0, percentile=100.00%, depth=16

Run status group 0 (all jobs):
   READ: bw=9489KiB/s (9717kB/s), 1174KiB/s-1196KiB/s (1202kB/s-1225kB/s), io=8340MiB (8745MB), run=900001-900005msec